 TITLE laba5
;------------------------------------------------------------------------------
;ЛР  №4, команда №3, ІТ-01
;------------------------------------------------------------------------------
;----------------I.ЗАГОЛОВОК ПРОГРАМИ------------------------
IDEAL
MODEL SMALL
STACK 16384
;-----------------------II.МАКРОСИ--------------------------------------
; Складний макрос для ініціалізації
MACRO M_Init        ; Початок макросу 
    mov ax,@data    ; @data ідентифікатор, що створюються директивою model
    mov ds, ax  ; Завантаження початку сегменту даних в регістр ds
    mov es, ax  ; Завантаження початку сегменту даних в регістр es
ENDM M_Init     

;--------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------
DATASEG

;Оголошення двовимірного експериментального масиву 16х16
array2Db        DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                Dw  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
                DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6',13, 10,'$'

exCode  DB 0
Vladbrth dw '1','4','0','2','2','0','0','3'
Andrybrth dw '1','8','1','1','2','0','0','2'
Irabrth  dw '0','5','0','7','2','0','0','3'
Codeseg

;----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------
Start: 
M_Init
call sort  ; сортуємо масив
xor si,si
lea ax,[array2Db]   ; записуємо в регістр початок масиву
mov dx,ax
mov ah, 09h
int 21h             ; виводисо відсортований масив
mov ah,01h
int 21h             ; чекаємо на введення клавіші
lea si,[array2Db]
add si,66h             ; переміщуємось на координати (3,3)
mov cx,2            
add_to_array:           ; вставляємо прямокутник з датами 8х6
    lea di,[Vladbrth]   ; записуємо в регістр початок сегменту памяті дат
    push cx             ; запамятовуємо кількість ітерацій
    call add_brth        ; записуємо 1 дату
    add si,10h              ; переміщуємось на рядок
    call add_brth           ; записуємо 2 дату
    add si,10h
    call add_brth           ; записуємо 3 дату
    pop cx                  ; повертаємо в регістр кількість ітерцій, що залишилися
    add si,10h
loop add_to_array


lea di,[Vladbrth]       ; додаємо до прямокутника 8х6 ще 2 дати
call add_brth
add si,10h
call add_brth

mov ah, 09h             ; виводимо масив з датами
int 21h
mov ah,01h
int 21h

mov ah,4ch              ;завершення програми
mov al,[exCode]
int 21h 
;---------------------Процедури-----------------------------------------
proc sort
mov bp,256  ; записуємо кількість ітерацій зовнішнього циклу
C:
    mov cx, 256 ; записуємо кількість ітерацій внутрішньго циклу
    dec cx      ; зменшуємо на одиницю кільксть ітерцій внутрішнього циклу
    lea bx, [array2Db] ; записуємо у регістр початок сегменту памяті, де зберігається масив
    mov si, 510             ; переходимо в кінець масиву
B:
    mov ax, [bx + si]  ; записуємо в регістр останній елемент масиву
    mov di, si
    A:  
        sub di, 2           
        mov dx, [bx + di]       ; переходиом до наступного елементу(рахуючи з кінця)
 
        cmp ax, dx              ; порівняння цих 2 елементів
        jng next                 ; якщо преший елемент не більший, пропускаємо наступні 2 кроки
            mov [bx+di], ax     ; міняємо місцями 2 елементи
            mov [bx+si], dx
     next:
     sub si, 2                  ; переходимо да наступного елементу
     loop B
        xor si, si             ; анулюємо індексні регістри щоб прейти до наступного кроку
         xor di, di
         dec bp                ; позначаємо, що ітерацію завершено
         cmp bp,0               ; порівнюємо кількість операцій з 0
         jne c                  ; поки кільксть ітерацій не буде рівним нулю, повторюєм цикл
 
 
ret
endp sort
   
proc add_brth
mov cx,8                ; задаємо кількість ітерацій
do_it:
mov ax,[ds:di]              ; записуємо в регістр цифру з дати
mov [ds:si],ax              ; записуємо цю цифру в масив
add si,2                    ; преходимо до наступної цифри
add di,2
loop do_it
ret
endp add_brth
 
end Start