;ЛР  №6
;------------------------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:     1) Написати функцію обробки переривання, що виводить на консоль 
;				№ групи і прізвища авторів  
; 				2) Перепризначити функцію на вектор переривань 53
;				50 + 3 (номер групи)
;				3) повернути мікропроцесорну систему (МПС) у вихідний стан
; ВУЗ:          НТУУ "КПІ"
; Факультет:    ФІОТ
; Курс:         1
; Група:        ІТ-01
;------------------------------------------------------------------------------
; Дата:         20.04.2021
;---------------------------------
				;I.ЗАГОЛОВОК ПРОГРАМИ
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
				
				;II.ПОЧАТОК СЕГМЕНТУ ДАНИХ 
DATASEG
	msg0 db "-- Laba #6 --",10,13,'$'	
	msg1 db "Group N 3: Dmytriieva, Honcharenco, Chorniy",10,13,'$'	
	msg2 db "-- Finish --",10,13,'$'	
	
	
	exCode db 0
	
				;III. ПОЧАТОК СЕГМЕНТУ КОДУ
CODESEG


proc main 

;--------------------------------- 1. Ініціалізація DS и ES--------------------------------------	
	mov ax,@data	; @data ідентифікатор, що створюються директивою model
	mov ds, ax	; Завантаження початку сегменту даних в регістр ds
	mov es, ax	; иніціалізація регістру ES

; ЕТАП 1 - отримання ефективної адреси і зміщення переривання: 

	mov ah, 25h		; встановити вектор переривання (потребує встановлення номера вектора в al та адреси ПОП в dx)
					; записує вектор переривання в таблицю векторів переривання (3)
					; При виклику AH=25h
					; AL – номер переривання 
					; DS:DX – указатель на програму обробки переривання (ПОП)
	mov al, 53h		; номер вектора переривання (потребує 25h)
	mov dx, offset new_53h	; ефективна адреса процедури обробки переривання -> dx
	push ds				; DS зберігаємо у стеку (DS = data)
	push cs				; перезаписати сегмент кода CS -> DS через стек
	pop ds				; (DS=CS) DS:DX -> new_53h
	
	int 21h				; Dos Interrupt - викликає функцію 25h
	pop ds				; відновити DS (DS=data)
	
	; друк 1-ї строки
	mov dx, offset msg0
	mov ah,09h
	int 21h		; Виклик функції DOS 9h
	
	; ініціалізація переривання № 53 - друк 2-ї строки
	int 53h				;генерація 53 преривання для визову ПОП new_53h
	
	; друк 3-ї строки
	mov dx, offset msg2
	mov ah,09h
	int 21h		; Виклик функції DOS 9h	
	
;--------------------------------- Завершення програми------------------------------------------
	mov ah,4ch 		;Завантаження числа 4ch до регістру ah(Функція DOS 4ch - завершення програми)
	mov al,[exCode]	;отримання коду виходу 
	int 21h			;виклик функції DOS 4ch


endp main 

; ------------------------------------------- ПРОЦЕДУРА ОБРОБКИ ПРЕРИВАНЬ (ПОП)--------------------------------

	proc new_53h
		; Завантаження числа 09h до регістру ah
		; (Функція DOS 9h - команда виводу на консоль рядка)
		mov dx, offset msg1
		mov ah,09h
		int 21h		; Виклик функції DOS 9h
	iret
	endp new_53h   

END main