TITLE laba2
;------------------------------------------------------------------------------
;ЛР  №2
;------------------------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:              Вивести у знакову відеопам'ять архітектури МПС у реальному режимі інформацію
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                1
; Група:       ІТ-01
;------------------------------------------------------------------------------
; Автор:        Чорній В.І. Гончаренко А.А.
; Дата:         23/02/2021
;---------------------------------

IDEAL
Model small
STACK 256

CODESEG
Start:
    
    mov bx, 1604; задаємо початок прямокутника(80*2*10+2*2)
    mov ax,0B800h;задаємопочаток сегменту відеопам'яті
    mov es,ax
    mov cx, 20; задаємо кількість символів у 1 рядку

my_ptr:;створення циклу для 1 рядка
    mov [word es:bx], 3430h; запис симола у відео пам'ять
    add bx,2   ; зміщення адреси у відеопа'мяті
    Loop my_ptr ; виклик циклу
    add bx, 120; переведення рядка(80*2-20*2)
    mov cx,20; задаємо кількість символів у 1 рядку
my2_ptr:;створення циклу для 2 рядка
    mov [word es:bx], 3430h
    add bx,2
    Loop my2_ptr
    add bx, 120
    mov cx,20
my3_ptr:;створення циклу для 3 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my3_ptr
   add bx, 120
   mov cx,20
my4_ptr:;створення циклу для 4 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my4_ptr
   add bx, 120
   mov cx,20
my5_ptr:;створення циклу для 5 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my5_ptr
   add bx, 120
   mov cx,20
my6_ptr:;створення циклу для 6 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my6_ptr
   add bx, 120
   mov cx,20
my7_ptr:;створення циклу для 7 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my7_ptr 
   add bx, 120
   mov cx,20
my8_ptr:;створення циклу для 8 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my8_ptr
   add bx, 120
   mov cx,20
my9_ptr:;створення циклу для 9 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my9_ptr    
   add bx, 120
   mov cx,20
my10_ptr:;створення циклу для 10 рядка
   mov [word es:bx], 3430h
   add bx,2
   Loop my10_ptr     
mov ah,04Ch; функція виходу з програми
mov al,0; повернення вихідного коду
int 21h; виклик функції 04Сh

end Start
    
    